**`teams/nomis/windows_server_2022_jumpserver`** terraform plan on `push` event [#514](${url})

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_component.this["../components/windows_server_2022_jumpserver/jumpserver.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver/1.0.9/1"
        name                  = "Jumpserver"
      ~ tags                  = {
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
            # (14 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
            # (14 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_component.this["../components/windows_server_2022_jumpserver/prometheus_windows_exporter.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheuswindowsexporter/1.0.7/1"
        name                  = "PrometheusWindowsExporter"
      ~ tags                  = {
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
            # (14 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
            # (14 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-windows-server-2022-jumpserver"
        name         = "nomis_windows_server_2022_jumpserver"
      ~ tags         = {
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
            # (14 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
            # (14 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "Windows Server 2022 jumpserver"
      + distribution_configuration_arn   = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-windows-server-2022-jumpserver"
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = (known after apply)
      + name                             = "nomis_windows_server_2022_jumpserver"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "Jumpserver-version"                      = "1.0.9"
          + "PrometheusWindowsExporter-version"       = "1.0.7"
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "github-actor"                            = "jnq"
          + "image-pipeline"                          = "nomis_windows_server_2022_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.3"
          + "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.3"
          + "is-production"                           = "true"
          + "os-version"                              = "windows server 2022"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                        = "n/a"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + tags_all                         = {
          + "Jumpserver-version"                      = "1.0.9"
          + "PrometheusWindowsExporter-version"       = "1.0.7"
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "github-actor"                            = "jnq"
          + "image-pipeline"                          = "nomis_windows_server_2022_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.3"
          + "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.3"
          + "is-production"                           = "true"
          + "os-version"                              = "windows server 2022"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                        = "n/a"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE"
          + schedule_expression                = "cron(0 0 2 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2022-jumpserver/0.0.2" -> (known after apply)
      ~ date_created     = "2022-09-14T14:35:31.285Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2022-jumpserver/0.0.2" -> (known after apply)
        name             = "nomis_windows_server_2022_jumpserver"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Windows" -> (known after apply)
      ~ tags             = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
            # (13 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "github-actor"                            = "dominicrobinson-moj" -> "jnq"
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
            # (13 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "0.0.2" -> "0.0.3" # forces replacement
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver/1.0.9/1" -> "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheuswindowsexporter/1.0.7/1" # forces replacement
        }
      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheuswindowsexporter/1.0.7/1" -> "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver/1.0.9/1" # forces replacement
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

  # module.imagebuilder["windows_server_2022_jumpserver"].aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2022-jumpserver-0-0-2" -> (known after apply)
      ~ date_created                  = "2022-09-14T14:35:28.248Z" -> (known after apply)
      ~ date_updated                  = "2022-09-27T13:01:59.709Z" -> (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2022-jumpserver-0-0-2" -> (known after apply)
      ~ name                          = "nomis_windows_server_2022_jumpserver_0_0_2" -> "nomis_windows_server_2022_jumpserver_0_0_3" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
            # (14 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
            # (14 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.0.2" -> "nomis_windows_server_2022_jumpserver/0.0.3"
            # (14 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 3 to change, 2 to destroy.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on ../modules/imagebuilder/versions.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

```